#ifndef INTERFACE_H__
#define INTERFACE_H__

#define INTRANCE "\
Программа осуществляет поиск оптимального туристического маршрута по городам, \
так чтобы посетить каждый город по 1 разу.\n\
\n\
Оригинальное задание:\n\
Задана система двусторонних дорог. Найти два города и соединяющий их путь, \
который проходит через каждую из дорог системы только один раз\n\
\n\
Связь городов представлена неориентированным графом, который хранится в памяти 2 способами:\n\
- матрица смежности \n\
- список смежности\n\
\n\
\n"

































#endif
