#ifndef INTERFACE_H__
#define INTERFACE_H__

#define LIST_GRAPH 1
#define MTRX_GRAPH 2

#define INTRANCE "\
Программа осуществляет поиск эйлерова пути в неориентированном графе, \n\
представленном в виде матрицы и списка смежности,\n\
а так же сравнивает эффективность этих двух представлений графа\n\
\n\
Оригинальное задание:\n\
Задана система двусторонних дорог. Найти два города и соединяющий их путь, \
который проходит через каждую из дорог системы только один раз\n\
\n\
\n"

#define CHOSE_TYPE "\
Связь городов представлена неориентированным графом, который хранится в памяти 2 способами:\n\
1 - список смежности\n\
2 - матрица смежности \n\
\n\
Выберете тип графа с, которым программа будет работать: \
"
































#endif
